backend/tests/stress/stress-endurance.yml
# ============================================================
# STRESS-ENDURANCE: Pruebas de estres -- Duracion prolongada (soak)
# Objetivo: Detectar memory leaks, degradacion gradual y fugas de recursos
# Escenarios: STRESS-10, STRESS-11, STRESS-12
# ============================================================

config:
  target: "http://localhost:3000"
  # Patron soak: carga moderada pero sostenida por largo tiempo
  phases:
    - duration: 20
      arrivalRate: 5
      name: "Calentamiento"
    - duration: 300
      arrivalRate: 15
      name: "Carga sostenida prolongada (5 min)"
    - duration: 20
      arrivalRate: 5
      name: "Enfriamiento"
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  # STRESS-10: Soak de autenticacion prolongada
  # 5 minutos de login + /me continuo.
  # Busca: memory leaks en jwt, conexiones DB no liberadas.
  - name: "STRESS-10: Soak de autenticacion (5 min)"
    weight: 2
    flow:
      - post:
          url: "/api/v1/auth/login"
          json:
            email: "loadtest@loadtest.com"
            contrasena: "LoadTestPass123!"
          capture:
            - json: "$.data.token"
              as: "token"
      - get:
          url: "/api/v1/auth/me"
          headers:
            Authorization: "Bearer {{ token }}"
      - think: 1

  # STRESS-11: Soak de polling de notificaciones
  # Simula el frontend haciendo polling continuo durante 5 minutos.
  # Busca: degradacion gradual del pool, crescendo de latencia.
  - name: "STRESS-11: Soak de polling notificaciones (5 min)"
    weight: 2
    flow:
      - post:
          url: "/api/v1/auth/login"
          json:
            email: "loadtest@loadtest.com"
            contrasena: "LoadTestPass123!"
          capture:
            - json: "$.data.token"
              as: "token"
      - loop:
          - get:
              url: "/api/v1/notifications/unread-count"
              headers:
                Authorization: "Bearer {{ token }}"
          - think: 3
        count: 3

  # STRESS-12: Soak de queries pesadas
  # 5 minutos de queries con JOINs + calculo IA.
  # Busca: acumulacion de conexiones, out of memory de PostgreSQL.
  - name: "STRESS-12: Soak de queries pesadas (5 min)"
    weight: 1
    flow:
      - post:
          url: "/api/v1/auth/login"
          json:
            email: "loadtest@loadtest.com"
            contrasena: "LoadTestPass123!"
          capture:
            - json: "$.data.token"
              as: "token"
      - get:
          url: "/api/v1/sessions/my-sessions"
          headers:
            Authorization: "Bearer {{ token }}"
      - get:
          url: "/api/v1/ia/riesgo-abandono"
          headers:
            Authorization: "Bearer {{ token }}"
      - think: 2